org/twitter.org
#+TITLE: Tweets

#+BEGIN_HTML
  <div class="header">
#+END_HTML

* Eryk Banatt
  :PROPERTIES:
  :CUSTOM_ID: eryk-banatt
  :END:

Cognitive Science Student, CS Enthusiast, Melee Player, Button Presser

--------------

-  [[file:index.html][Home]]
-  [[file:about.html][About/Contact]]
-  [[file:projects.html][Projects]]
-  [[file:melee.html][Melee]]
-  [[file:links.html][Links]]
-  [[file:resume.pdf][Resume]]

--------------

#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div class="pagetext">
#+END_HTML

* Twitter-Sized Things I've Done
  :PROPERTIES:
  :CUSTOM_ID: twittersizedthingsivedone
  :END:

I post very frequently on Twitter, usually with Melee-related jokes and
quips. However, every so often I do a project that I think is
interesting but doesn't warrant an extensive writeup. For these I
usually post on twitter, but as with blogs it becomes hard to go back
and find something you want (especially if ~90% of your posts are
jokes). So this page is sort of an index of my tweets that had actual
substance to them.

** SSBM Theorycraft:
   :PROPERTIES:
   :CUSTOM_ID: ssbmtheorycraft
   :END:

[[https://twitter.com/Ambisinister_/status/894236993554714624][Q-Drop
shield pressure (video)]]

[[https://twitter.com/Ambisinister_/status/894301430693195776][RTA
Viable Peach shield break w/ Mr. Saturn (video)]]

[[https://twitter.com/Ambisinister_/status/871824094576168962][Jigglypuff
bair from ledge -> no-jump sing ledgegrab]]

[[https://twitter.com/Ambisinister_/status/860968102330339328][Upthrow
-> Dash Pivot Shine (not very practical)]]

[[https://twitter.com/Ambisinister_/status/836512860343832577][Z-Axis
causing sheik fair to whiff]]

[[https://twitter.com/Ambisinister_/status/825201587320668160][Fox Nair
frame advantage vs. Aerial Height (infographic)]]

[[https://twitter.com/Ambisinister_/status/805533354368126980][Tournament
Winner walljump doublejump bair on rock transformation (video)]]

** DIY Projects
   :PROPERTIES:
   :CUSTOM_ID: diyprojects
   :END:

[[https://twitter.com/Ambisinister_/status/871937662843858944][Mechanical
Keyboard Gamecube Controller Triggers]]

** Stats:
   :PROPERTIES:
   :CUSTOM_ID: stats
   :END:

[[https://twitter.com/Ambisinister_/status/886288045330358273][Evo 2017
R1 Pools results demographics (collab w/ Algebra)]]

[[https://twitter.com/ambisinister_/status/903323311089885185][Bet on
implementation of UCF ($10, 1:1 odds, with @uconnsdoom)]]

/[[https://twitter.com/Ambisinister_/status/913580629996064768][The
Local is Dying]]/ (Tongue-in-cheek analysis of attendance at SSBM
locals)

** Fun:
   :PROPERTIES:
   :CUSTOM_ID: fun
   :END:

[[https://twitter.com/Ambisinister_/status/878703025933647877][Giant
Bob-omb]]

[[https://twitter.com/Ambisinister_/status/865480825990557699][Upsmash
-> Reverse Bair -> doublejump reverse bair -> Shine]]

[[https://twitter.com/Ambisinister_/status/862934717234122753][Samus
Hammer Glitch]]

[[https://twitter.com/Ambisinister_/status/860951801922822144][Slapdash
-> dash -> pivot dtilt]]

[[https://twitter.com/Ambisinister_/status/859132350134972417][Please
stop posting about ranges using hitlag images]]

[[https://twitter.com/Ambisinister_/status/855232001242259456][Bolt
Winner's Interview ambisinister commerical]]

[[https://twitter.com/Ambisinister_/status/852800180021731328][Sick
teams save]]

[[https://twitter.com/Ambisinister_/status/840328225209356288][peach
waveshine infinite x2]]

[[https://twitter.com/Ambisinister_/status/832516318670811136][Thing I
plan on retweeting whenever I lose to marths]]

[[https://twitter.com/Ambisinister_/status/832513545858326528][Ness fun
NBA HRC strat]]

[[https://twitter.com/Ambisinister_/status/803116412864724992][bbesSlyFox]]

#+BEGIN_HTML
  </div>
#+END_HTML
