twitter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tweets</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Tweets</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#eryk-banatt">Eryk Banatt</a></li>
<li><a href="#twittersizedthingsivedone">Twitter-Sized Things I've Done</a>
<ul>
<li><a href="#ssbmtheorycraft">SSBM Theorycraft:</a></li>
<li><a href="#diyprojects">DIY Projects</a></li>
<li><a href="#stats">Stats:</a></li>
<li><a href="#fun">Fun:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="HTML" id="org1a80456">
<p>
&lt;div class="header"&gt;
</p>

</div>

<div id="outline-container-eryk-banatt" class="outline-1">
<h1 id="eryk-banatt">Eryk Banatt</h1>
<div class="outline-text-1" id="text-eryk-banatt">
<p>
Cognitive Science Student, CS Enthusiast, Melee Player, Button Presser
</p>

<hr />

<ul class="org-ul">
<li><a href="index.html">Home</a></li>
<li><a href="about.html">About/Contact</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="melee.html">Melee</a></li>
<li><a href="links.html">Links</a></li>
<li><a href="resume.pdf">Resume</a></li>
</ul>

<hr />

<div class="HTML" id="orgf6f3c1e">
<p>
&lt;/div&gt;
</p>

</div>

<div class="HTML" id="org572fdcb">
<p>
&lt;div class="pagetext"&gt;
</p>

</div>
</div>
</div>

<div id="outline-container-twittersizedthingsivedone" class="outline-1">
<h1 id="twittersizedthingsivedone">Twitter-Sized Things I've Done</h1>
<div class="outline-text-1" id="text-twittersizedthingsivedone">
<p>
I post very frequently on Twitter, usually with Melee-related jokes and
quips. However, every so often I do a project that I think is
interesting but doesn't warrant an extensive writeup. For these I
usually post on twitter, but as with blogs it becomes hard to go back
and find something you want (especially if ~90% of your posts are
jokes). So this page is sort of an index of my tweets that had actual
substance to them.
</p>
</div>

<div id="outline-container-ssbmtheorycraft" class="outline-2">
<h2 id="ssbmtheorycraft">SSBM Theorycraft:</h2>
<div class="outline-text-2" id="text-ssbmtheorycraft">
<p>
<a href="https://twitter.com/Ambisinister_/status/894236993554714624">Q-Drop
shield pressure (video)</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/894301430693195776">RTA
Viable Peach shield break w/ Mr. Saturn (video)</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/871824094576168962">Jigglypuff
bair from ledge -&gt; no-jump sing ledgegrab</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/860968102330339328">Upthrow
-&gt; Dash Pivot Shine (not very practical)</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/836512860343832577">Z-Axis
causing sheik fair to whiff</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/825201587320668160">Fox Nair
frame advantage vs. Aerial Height (infographic)</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/805533354368126980">Tournament
Winner walljump doublejump bair on rock transformation (video)</a>
</p>
</div>
</div>

<div id="outline-container-diyprojects" class="outline-2">
<h2 id="diyprojects">DIY Projects</h2>
<div class="outline-text-2" id="text-diyprojects">
<p>
<a href="https://twitter.com/Ambisinister_/status/871937662843858944">Mechanical
Keyboard Gamecube Controller Triggers</a>
</p>
</div>
</div>

<div id="outline-container-stats" class="outline-2">
<h2 id="stats">Stats:</h2>
<div class="outline-text-2" id="text-stats">
<p>
<a href="https://twitter.com/Ambisinister_/status/886288045330358273">Evo 2017
R1 Pools results demographics (collab w/ Algebra)</a>
</p>

<p>
<a href="https://twitter.com/ambisinister_/status/903323311089885185">Bet on
implementation of UCF ($10, 1:1 odds, with @uconnsdoom)</a>
</p>

<p>
<i><a href="https://twitter.com/Ambisinister_/status/913580629996064768">The
Local is Dying</a></i> (Tongue-in-cheek analysis of attendance at SSBM
locals)
</p>
</div>
</div>

<div id="outline-container-fun" class="outline-2">
<h2 id="fun">Fun:</h2>
<div class="outline-text-2" id="text-fun">
<p>
<a href="https://twitter.com/Ambisinister_/status/878703025933647877">Giant
Bob-omb</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/865480825990557699">Upsmash
-&gt; Reverse Bair -&gt; doublejump reverse bair -&gt; Shine</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/862934717234122753">Samus
Hammer Glitch</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/860951801922822144">Slapdash
-&gt; dash -&gt; pivot dtilt</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/859132350134972417">Please
stop posting about ranges using hitlag images</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/855232001242259456">Bolt
Winner's Interview ambisinister commerical</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/852800180021731328">Sick
teams save</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/840328225209356288">peach
waveshine infinite x2</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/832516318670811136">Thing I
plan on retweeting whenever I lose to marths</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/832513545858326528">Ness fun
NBA HRC strat</a>
</p>

<p>
<a href="https://twitter.com/Ambisinister_/status/803116412864724992">bbesSlyFox</a>
</p>

<div class="HTML" id="orgec9b4dc">
<p>
&lt;/div&gt;
</p>

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
